In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
}

In [31]:
df = pd.DataFrame(data, index=[0, 1, 2, 3, 4])
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [32]:
df.ix[1:3]

   pop   state  year
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001

In [33]:
df[1:3]

   pop state  year
1  1.7  Ohio  2001
2  3.6  Ohio  2002

In [34]:
df['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [36]:
df.ix[1:3, ['state', 'year']]

    state  year
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001

In [37]:
df2 = pd.DataFrame(data, 
                   columns=['year', 'state', 'pop'],
                   index=['one', 'two', 'three', 'four', 'five'])
df2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [38]:
df2.ix[['two', 'three'], ['state', 'pop']]

      state  pop
two    Ohio  1.7
three  Ohio  3.6

In [39]:
df2.ix[['two', 'three'], :2]

       year state
two    2001  Ohio
three  2002  Ohio

In [41]:
df2.ix[['two', 'three'], "year":"pop"]

       year state  pop
two    2001  Ohio  1.7
three  2002  Ohio  3.6

In [42]:
df2.ix[:, ["year"]]

       year
one    2000
two    2001
three  2002
four   2001
five   2002

In [43]:
df2.ix['two']

year     2001
state    Ohio
pop       1.7
Name: two, dtype: object

In [45]:
df2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [46]:
df2.ix[:, 'year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [47]:
df = pd.DataFrame(np.random.randn(5, 3))
df

          0         1         2
0  0.187150  0.165504 -0.936253
1 -1.900760  0.677314 -2.131821
2 -0.677108 -1.579137  0.815046
3 -1.095214 -0.519310  1.691619
4 -1.432162 -1.728324 -0.858935

In [51]:
df.ix[0:2, 1:2]

          1         2
0  0.165504 -0.936253
1  0.677314 -2.131821
2 -1.579137  0.815046

In [52]:
df.columns=['c1', 'c2', 'c3']

In [53]:
df.ix[0:2, 1:2]

         c2
0  0.165504
1  0.677314
2 -1.579137

In [54]:
np.random.seed(1)
df = pd.DataFrame(np.random.randint(1, 11, size=(4,3)), 
                  columns=["A", "B", "C"], index=["a", "b", "c", "d"])
df

    A  B   C
a   6  9  10
b   6  1   1
c   2  8   7
d  10  3   5

In [55]:
df.ix['a':'c', 'A':'B']

   A  B
a  6  9
b  6  1
c  2  8

In [56]:
df.ix[0:2, 0:1]

   A
a  6
b  6

In [57]:
df.loc[['a', 'c'], :]

   A  B   C
a  6  9  10
c  2  8   7

In [59]:
df.iloc[0:2, :]

   A  B   C
a  6  9  10
b  6  1   1

In [60]:
np.random.seed(1)

In [61]:
df = pd.DataFrame(np.random.randint(10, size = (4, 8)))
df

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [62]:
df.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [63]:
df['sums'] = df.sum(axis=1)

In [64]:
df

   0  1  2  3  4  5  6  7  sums
0  5  8  9  5  0  0  1  7    35
1  6  9  2  4  5  2  4  2    34
2  4  7  7  9  1  7  0  6    41
3  9  9  7  6  9  1  0  1    42

In [65]:
df.sum(axis=0)

0        24
1        33
2        25
3        24
4        15
5        10
6         5
7        16
sums    152
dtype: int64

In [66]:
df.ix['total'] = df.sum()

In [67]:
df

        0   1   2   3   4   5  6   7  sums
0       5   8   9   5   0   0  1   7    35
1       6   9   2   4   5   2  4   2    34
2       4   7   7   9   1   7  0   6    41
3       9   9   7   6   9   1  0   1    42
total  24  33  25  24  15  10  5  16   152